[
	{
		"Type": "Article",
		"HTML": "<h1>Do I Wanna Know</h1><hr><p><span class=\"firstcharacter\">H</span>ave you got colour in your cheeks?<br>Do you ever get that fear that you can't shift<br>The type that sticks around like something in your teeth?<br>Are there some aces up your sleeve?<br>Have you no idea that you're in deep?<br>I dreamt about you nearly every night this week<br>How many secrets can you keep?<br>'Cause there's this tune I found that makes me think of you somehow and I play it on repeat<br>Until I fall asleep<br>Spilling drinks on my settee<br></p><p>(Do I wanna know?)<br>If this feeling flows both ways?<br>(Sad to see you go)<br>Was sort of hoping that you'd stay<br>(Baby, we both know)<br>That the nights were mainly made for saying things that you can't say tomorrow day<br></p><p>Crawling back to you<br></p><p>Ever thought of calling when you've had a few?<br>'Cause I always do<br>Maybe I'm too busy being yours to fall for somebody new<br>Now I've thought it through<br></p><p>Crawling back to you<br></p><p>So have you got the guts?<br>Been wondering if your heart's still open and if so I wanna know what time it shuts<br>Simmer down and pucker up<br>I'm sorry to interrupt. It's just I'm constantly on the cusp of trying to kiss you<br>I don't know if you feel the same as I do<br>But we could be together if you wanted to<br></p><p>(Do I wanna know?)<br>If this feeling flows both ways?<br>(Sad to see you go)<br>Was sort of hoping that you'd stay<br>(Baby, we both know)<br>That the nights were mainly made for saying things that you can't say tomorrow day<br></p><p>Crawling back to you (crawling back to you)<br></p><p>Ever thought of calling when you've had a few? (you've had a few)<br>'Cause I always do ('cause I always do)<br>Maybe I'm too (maybe I'm too busy) busy being yours to fall for somebody new<br>Now I've thought it through<br></p><p>Crawling back to you<br></p><p>(Do I wanna know?)<br>If this feeling flows both ways?<br>(Sad to see you go)<br>Was sort of hoping that you'd stay<br>(Baby, we both know)<br>That the nights were mainly made for saying things that you can't say tomorrow day<br></p><p>(Do I wanna know?)<br>Too busy being yours to fall<br>(Sad to see you go)<br>Ever thought of calling darling?<br>(Do I wanna know?)<br>Do you want me crawling back to you?<br>"
	}
]