[
	{
		"Type": "Article",
		"HTML": "<h1>Interview with <i>Twist Online</i></h1><hr><p><!--The about section style photo--><img src=\"about/Corbin Hale.PNG\" style=\"float:right;width: 50%;margin:20px;margin-top: 0px;border: 5px solid white; border-radius: 2px; margin-right: 0px; box-shadow: 0px 0px 10px black\"><span class=\"firstcharacter\">\"W</span>e have recently interviewed Singer-songwriter, Corbin Hale, who was born in Rio De Janeiro and raised in a quaint little town outside the city. He has recently released his debut EP, Chapter One.</p><p><b>Twist Online: First of all tell us about the start of your professional career?</b></p><p><b>Corbin Hale:</b> My life as a professional singer started playing in bands back in Rio and then recording covers on YouTube. The first one was an Arctic Monkeys cover “Do I Wanna Know”.</p><p><b>Twist Online: Who or what inspired you to get into music industry?</b></p><p><b>Corbin Hale:</b> My parents have always played old Rock and my dad gave me my first guitar and taught me some songs. My grandpa taught me the piano/organ, so I can say I’ve always been surrounded with good music. But I think seeing Bon Jovi live was the moment I started seeing it as a dream and started getting professional.</p><p><b>Twist Online: Tell us about your debut EP, Chapter One?</b></p><p><b>Corbin Hale:</b> “Chapter One” represents the beginning of a dream that was kept private for a long time. It’s my first big project involving original songs after I moved to Canada to really become the man I’ve always wanted to be. I recorded pretty much every song while moving and getting used to my new life, missing my friends and family and discovering myself, so I can really say that “Chapter One” reflects who I am now and who I aim to be tomorrow.</p><p><b>Twist Online: What kind of response you have received from the release?</b></p><p><b>Corbin Hale:</b> Very good. It means a lot when someone tells me that they could relate to my lyrics and that my music helped them somehow. That’s why I do what I do.</p><p><b>Twist Online: What attracts you more, performing on stage or working in studios?</b>Corbin Hale:</b> I think seeing a verse you wrote introspectively in your bedroom turned into a real song is magical. But performing on stage is still the most inspiring moment.</p><p><b>Twist Online: What’s your favorite music genre?</b></p><p><b>Corbin Hale:</b> Rock, Pop/Rock. Some old stuff like The Beatles, Bon Jovi and some new stuff like Coldplay, Arctic Monkeys, The Killers… A bit of everything, I’d say.</p><p><b>Twist Online: Have you set some target to achieve as a music artist?</b></p><p><b>Corbin Hale:</b> I don’t set goals. I have a mission. As long as I stay true to it, I am good.</p><p><b>Twist Online: And what is that mission?</b></p><p><b>Corbin Hale:</b> To inspire people to pursuit their dreams through my story and my music.</p><p><b>Full interview: <a href=http://www.twistonline.net/a-conversation-with-corbin-hale-about-his-debut-ep-chapter-one/><i>http://www.twistonline.net/a-conversation-with-corbin-hale-about-his-debut-ep-chapter-one/</i></a><!--Full width photo at the end--></p>"
	}
]