[
	{
		"Type": "Article",
		"HTML": "<h1><i>"Chapter One"</i> is Out Now!</h1><hr><p><!--The about section style photo--><img src=\"news/articles/chapterone/FrontCover.png" style=\"float:right;width: 50%;margin:20px;margin-top: 0px;border: 5px solid white; border-radius: 2px; margin-right: 0px; box-shadow: 0px 0px 10px black\"><span class=\"firstcharacter\">F</span>illed with heartfelt and finely-crafted hooks, raspy vocals and empowering lyrics, Corbin Hale’s aptly titled “Chapter One” (EP) is finally released. The work is set to become a timeless and timely addition to rock music worldwide. It encapsulates the feelings of nostalgia with its old-school rock anthems and a modern twist with similar sounds of the Arctic Monkeys and The Killers. </p><p>“When I hold my first EP in my hands it takes me back to that one day I took the plane to Vancouver with nothing but dreams inside of my suitcase. Day by day we overcome obstacles and make our dreams come true”</p><p>His debut single, the haunting alt-rock ballad, Wasting Words , captures the final debris of a relationship ending. The track’s accompanying video illustrates a romance unraveling with panache and passion. </p><p>His second single, the infectious and ridiculously catchy pop-rock track Blue Jeans is a more light-hearted look into the young stud’s love life. Hale proudly takes a social stand as a peacekeeper and advocate for love with White Flag, the first original he ever recorded, a plea for peace directly inspired by the November 2015 Paris Attacks. </p><p>For a peek into Hale’s ambitious and more masculine side - The Man I’ve Gotta Be is his autobiographical track outlining his struggle between desires and responsibilities. It was written when Hale was torn between what was expected of him, and what he wanted. Thankfully, in the end, Corbin ended up becoming the man the wanted to be. In closing, he says: \"I don’t have a ‘Plan B’, I’m giving it all for my dreams. For the first time in my life I can see where I want to go and how to get there.” <p></p><p>Download/Stream “Chapter One” now!<br> <a href=\"http://fanlink.to/corbinhale\">http://fanlink.to/corbinhale</a></p>"
	}
]