[
	{
		"Type": "Article",
		"HTML": "<h1>Wasting Words (Review by TunedLoud)</h1><hr><p><!--The about section style photo--><img style=\"float:right;width: 60%;margin:20px;margin-bottom: 5px; margin-top: 0px;border: 5px solid white; border-radius: 2px; margin-right: 0px; box-shadow: 0px 0px 10px black\" src=\"news/articles/wastingwords/photo.png\"><span class=\"firstcharacter\">Y</span>ou will notice a trend in modern pop artists, in that good pop successfully borrows from other genres while never emulating them entirely; great pop artists readily showcase their influences, yet somehow make it abundantly clear to their audiences that their music comes from no one but themselves. Amidst what can arguably be called a steady flow of generic pop that tends towards whatever newfangled trend the airwaves have been conquered by, it is a breath of fresh air to discover an artist who truly puts himself out there in his own way, fitting almost seamlessly into the crowd yet being just different enough to make him special – overall, I’d say that Corbin Hale has done just that.</p><p>On his recently released single, “Wasting Words”, Corbin proves himself one hell of a singer-songwriter, and we can only wait to see the heights to which he will scale from here.Originally from the tropical city of Rio de Janeiro, Corbin Hale headed toward the rainy and inspiring city of Vancouver, Canada with nothing but a suitcase full of dreams and his love for music, which initially found inspiration in The Beatles and Bon Jovi.“Wasting Words” is focused, honest and fresh, even though it’s theme of a love in its final throes, is not an entirely new one. Corbin Hale writes lyrics far more honest and introspective than most of his pop-rock contemporaries and the man obviously has a voice to match the message of his song.From the soulful vocals and moving lyrics, to the ever-evolving pop-rock arrangement, Corbin Hale’s artistic prowess is on full display here. Corbin makes music that is timeless. He somehow combines relatable, guy-next-door ease with cool, city-boy charm.</p><p>He’s romantic and sensitive one minute, then randomly angry and sad, the next. “Wasting Words”fully capture Corbin’s many sides, as he narrates a romance that has reached the end of its course – where all the talking and all the words in the world, will no longer be able to heal the wounds suffered in a hurting relationship. You can tell he writes with a purpose and many of his lyrics are truly profound.There’s also another plus that Corbin Hale and a handful other artists coming out nowadays have, that is highly in their favor; they can’t be thrown into any one genre. Whether it’s because they recognize the universal value this gives them or because they have genuine talent in many categories obviously depends on the artist, but this is a huge advantage.Corbin also has this quality and uses it quite deftly. All around, “Wasting Words” is a genuinely well-crafted song that’s worthy of attention as a potential single, regardless of which genre you put it in.<!--Full width photo at the end--></p>"
	}
]