[
	{
		"Type": "Article",
		"HTML": "<h1>Hello! Testing 1, 2, 3!</h1><hr><p><span class=\"firstcharacter\">J</span>on Bon Jovi began playing piano and guitar in 1975, at the age of 13, with his first band \"Raze\". At 16, Bon Jovi met David Bryan and formed a band called \"Atlantic City Expressway\". Still in his teens, Bon Jovi played in the band \"John Bongiovi and the Wild Ones,\" playing local clubs like \"The Fast Lane,\" and opening for known acts in the area. By 1980, he formed another band, \"The Rest\", and opened up for New Jersey acts such as Southside Johnny and the Asbury Jukes.</p><p>By mid-1982, out of school and working part-time at a women's shoe store, Jon Bon Jovi took a job at the Power Station Studios, a Manhattan recording facility where his cousin Tony Bongiovi was co-owner. Bon Jovi made several demos - including one produced by Billy Squier - and sent them to record companies, though failing to make an impact. His first professional recording was as lead vocals in \"R2-D2 We Wish You a Merry Christmas,\" which was part of the Christmas in the Stars album which his cousin co-produced.</p><p>Bon Jovi visited local radio station WAPP 103.5FM \"The Apple\" in Lake Success, New York. In 1983, a then-unknown Bon Jovi visited the station and wrote and sang the jingles for the station. He spoke with DJ Chip Hobart and to the promotion director, John Lassman, who suggested Bon Jovi let WAPP include the song \"Runaway\" on the station's compilation album of local homegrown talent. Bon Jovi was reluctant, but eventually gave them the song, on which Bon Jovi had used studio musicians to play on the track \"Runaway\" (which was written in 1982). WAPP worked with WOR-TV (now WWOR-TV) in nearby Secaucus, NJ on a music video show, Rock 9 Videos, for a short time in 1984. The studio musicians who helped record \"Runaway\"—known as The All Star Review—were guitarist Tim Pierce, keyboardist Roy Bittan, drummer Frankie LaRocka, and bassist Hugh McDonald.</p><p>The song began to get airplay in the New York area, then other sister stations in major markets picked up the song. In March 1983, Bon Jovi called David Bryan, who in turn called bassist Alec John Such and an experienced drummer named Tico Torres, both formerly of the band Phantom's Opera. Tapped to play lead guitar was Bon Jovi's neighbor, Dave Sabo (a.k.a. The Snake)—although he never officially joined the band. He and Jon promised each other that whoever made it first, would help out the other. He later went on to form the group Skid Row. Jon saw and was impressed with hometown guitarist Richie Sambora. Sambora had toured with Joe Cocker, played with a group called Mercy and had been called up to audition for Kiss. He also played on the album Lessons with the band Message, which was re-released on CD through Long Island Records in 1995. Message was originally signed to Led Zeppelin's Swan Song Records label, although the album was never released.</p><p>Tico Torres was also an experienced musician, having recorded and played live with Phantom's Opera, The Marvelettes, and Chuck Berry. He appeared on 26 records and had recently recorded with Franke and the Knockouts, a Jersey band with hit singles during the early 1980s.</p><p>David Bryan had quit the band that he and Bon Jovi had founded in order to study medicine. While in college, he realized that he wanted to pursue music full-time, and was accepted to Juilliard School, a New York music school. When Bon Jovi called his friend and said that he was putting together a band, and a record deal looked likely, Bryan followed Bon Jovi's lead and gave up his studies.</p>"
	}
]